docs/posts/2008-06-01-costa-rica-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Costa Rica</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Costa Rica</h1>
<p class="subtitle" role="doc-subtitle">Jun 01, 2008</p>
</header><p>
We had a wonderful week in Costa Rica. It is a beautiful country filled with charming people. We had a tour of the rain forest canopy and two bus trips through the countryside. If you ever plan a trip to Costa Rica, consider avoiding the rainy season. It did rain every day while we were there, but cleared up beautifully, of course, on the day that we left.
</p>

<p>
While we were on the bus traveling to the rain forest, our guide, Oliver, gave us a lesson on the history, geography, and culture of the country. Two things that he was particularly proud of were that the country has no army and that they have more teachers than police. Speaking of human rights in Costa Rica and the lack of class conflict, he said &ldquo;We were lucky to be a poor country.&rdquo; I found his comment to be particularly striking. Why does this country develop into a stable and prosperous one that is free from both internal and external conflict? Oliver implies that it is because they didn&rsquo;t have anything that the developed world really wanted.
</p>

<p>
Things could be changing, both for us and the rest of the world, though. In this interesting piece in today&rsquo;s <i>New York Times</i>, <a href="http://www.nytimes.com/2008/06/02/opinion/l02cohen.html?th&amp;amp;emc=th">Roger Cohen</a> points out that two-thirds of last year&rsquo;s economic growth was in the developing world. This could indeed be a reversal of fortune.
</p>


<div class="tagline" id="org89b865a">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
